apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ccfg.h
/************************************************************************************************************
 * arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ccfg.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************************/

#ifndef __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_CCFG_H
#define __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_CCFG_H

/************************************************************************************************************
 * Included Files
 ************************************************************************************************************/

#include <nuttx/config.h>
#include "hardware/tiva_memorymap.h"

/************************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************************/

/* CCFG Register Offsets ************************************************************************************/

#define TIVA_CCFG_EXT_LF_CLK_OFFSET             0x1fa8  /* Extern LF clock configuration */
#define TIVA_CCFG_MODE_CONF_1_OFFSET            0x1fac  /* Mode Configuration 1 */
#define TIVA_CCFG_SIZE_AND_DIS_FLAGS_OFFSET     0x1fb0  /* CCFG Size and Disable Flags */
#define TIVA_CCFG_MODE_CONF_OFFSET              0x1fb4  /* Mode Configuration 0 */
#define TIVA_CCFG_VOLT_LOAD_0_OFFSET            0x1fb8  /* Voltage Load 0 */
#define TIVA_CCFG_VOLT_LOAD_1_OFFSET            0x1fbc  /* Voltage Load 1 */
#define TIVA_CCFG_RTC_OFFSET_OFFSET             0x1fc0  /* Real Time Clock Offset */
#define TIVA_CCFG_FREQ_OFFSET_OFFSET            0x1fc4  /* Frequency Offset */
#define TIVA_CCFG_IEEE_MAC_0_OFFSET             0x1fc8  /* IEEE MAC Address 0 */
#define TIVA_CCFG_IEEE_MAC_1_OFFSET             0x1fcc  /* IEEE MAC Address 1 */
#define TIVA_CCFG_IEEE_BLE_0_OFFSET             0x1fd0  /* IEEE BLE Address 0 */
#define TIVA_CCFG_IEEE_BLE_1_OFFSET             0x1fd4  /* IEEE BLE Address 1 */
#define TIVA_CCFG_BL_CONFIG_OFFSET              0x1fd8  /* Bootloader Configuration */
#define TIVA_CCFG_ERASE_CONF_OFFSET             0x1fdc  /* Erase Configuration */
#define TIVA_CCFG_CCFG_TI_OPTIONS_OFFSET        0x1fe0  /* TI Options */
#define TIVA_CCFG_CCFG_TAP_DAP_0_OFFSET         0x1fe4  /* Test Access Points Enable 0 */
#define TIVA_CCFG_CCFG_TAP_DAP_1_OFFSET         0x1fe8  /* Test Access Points Enable 1 */
#define TIVA_CCFG_IMAGE_VALID_CONF_OFFSET       0x1fec  /* Image Valid */
#define TIVA_CCFG_CCFG_PROT_31_0_OFFSET         0x1ff0  /* Protect Sectors 0-31 */
#define TIVA_CCFG_CCFG_PROT_63_32_OFFSET        0x1ff4  /* Protect Sectors 32-63 */
#define TIVA_CCFG_CCFG_PROT_95_64_OFFSET        0x1ff8  /* Protect Sectors 64-95 */
#define TIVA_CCFG_CCFG_PROT_127_96_OFFSET       0x1ffc  /* Protect Sectors 96-127 */

/* CCFG Register Addresses **********************************************************************************/

#define TIVA_CCFG_EXT_LF_CLK                    (TIVA_CCFG_BASE + TIVA_CCFG_EXT_LF_CLK_OFFSET)
#define TIVA_CCFG_MODE_CONF_1                   (TIVA_CCFG_BASE + TIVA_CCFG_MODE_CONF_1_OFFSET)
#define TIVA_CCFG_SIZE_AND_DIS_FLAGS            (TIVA_CCFG_BASE + TIVA_CCFG_SIZE_AND_DIS_FLAGS_OFFSET)
#define TIVA_CCFG_MODE_CONF                     (TIVA_CCFG_BASE + TIVA_CCFG_MODE_CONF_OFFSET)
#define TIVA_CCFG_VOLT_LOAD_0                   (TIVA_CCFG_BASE + TIVA_CCFG_VOLT_LOAD_0_OFFSET)
#define TIVA_CCFG_VOLT_LOAD_1                   (TIVA_CCFG_BASE + TIVA_CCFG_VOLT_LOAD_1_OFFSET)
#define TIVA_CCFG_RTC_OFFSET                    (TIVA_CCFG_BASE + TIVA_CCFG_RTC_OFFSET_OFFSET)
#define TIVA_CCFG_FREQ_OFFSET                   (TIVA_CCFG_BASE + TIVA_CCFG_FREQ_OFFSET_OFFSET)
#define TIVA_CCFG_IEEE_MAC_0                    (TIVA_CCFG_BASE + TIVA_CCFG_IEEE_MAC_0_OFFSET)
#define TIVA_CCFG_IEEE_MAC_1                    (TIVA_CCFG_BASE + TIVA_CCFG_IEEE_MAC_1_OFFSET)
#define TIVA_CCFG_IEEE_BLE_0                    (TIVA_CCFG_BASE + TIVA_CCFG_IEEE_BLE_0_OFFSET)
#define TIVA_CCFG_IEEE_BLE_1                    (TIVA_CCFG_BASE + TIVA_CCFG_IEEE_BLE_1_OFFSET)
#define TIVA_CCFG_BL_CONFIG                     (TIVA_CCFG_BASE + TIVA_CCFG_BL_CONFIG_OFFSET)
#define TIVA_CCFG_ERASE_CONF                    (TIVA_CCFG_BASE + TIVA_CCFG_ERASE_CONF_OFFSET)
#define TIVA_CCFG_CCFG_TI_OPTIONS               (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_TI_OPTIONS_OFFSET)
#define TIVA_CCFG_CCFG_TAP_DAP_0                (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_TAP_DAP_0_OFFSET)
#define TIVA_CCFG_CCFG_TAP_DAP_1                (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_TAP_DAP_1_OFFSET)
#define TIVA_CCFG_IMAGE_VALID_CONF              (TIVA_CCFG_BASE + TIVA_CCFG_IMAGE_VALID_CONF_OFFSET)
#define TIVA_CCFG_CCFG_PROT_31_0                (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_PROT_31_0_OFFSET)
#define TIVA_CCFG_CCFG_PROT_63_32               (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_PROT_63_32_OFFSET)
#define TIVA_CCFG_CCFG_PROT_95_64               (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_PROT_95_64_OFFSET)
#define TIVA_CCFG_CCFG_PROT_127_96              (TIVA_CCFG_BASE + TIVA_CCFG_CCFG_PROT_127_96_OFFSET)

/* CCFG Bifield Definitions *********************************************************************************/

/* TIVA_CCFG_EXT_LF_CLK */

#define CCFG_EXT_LF_CLK_RTC_INCREMENT_SHIFT     (0)       /* Bits 0-23: Input frequency of the external clock */
#define CCFG_EXT_LF_CLK_RTC_INCREMENT_MASK      (0xffffff << CCFG_EXT_LF_CLK_RTC_INCREMENT_SHIFT)
#define CCFG_EXT_LF_CLK_DIO_SHIFT               (24)      /* Bits 24-31: DIO to supply external 32kHz clock */
#define CCFG_EXT_LF_CLK_DIO_MASK                (0xff << CCFG_EXT_LF_CLK_DIO_SHIFT)

