apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ccfg.h
/* TIVA_CCFG_MODE_CONF_1 */

#define CCFG_MODE_CONF_1_XOSC_MAX_START_SHIFT   (0)       /* Bits 0-7: Maximum XOSC startup time (100us units). */
#define CCFG_MODE_CONF_1_XOSC_MAX_START_MASK    (0xff << CCFG_MODE_CONF_1_XOSC_MAX_START_SHIFT)
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_SHIFT  (8)    /* Bits 8-11: Signed delta value for IBIAS_OFFSET */
#define CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_MASK   (15 << CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_SHIFT)
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_SHIFT (12)      /* Bits 12-15: Signed delta value for IBIAS_INIT */
#define CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_MASK  (15 << CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_SHIFT)
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_SHIFT   (16)      /* Bits 16-18: Inductor peak current */
                                                          /* Peak current = 31 + (4 * ALT_DCDC_IPEAK) */
#define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_MASK    (7 << CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_SHIFT)
#  define CCFG_MODE_CONF_1_ALT_DCDC_IPEAK(n)    ((uint32_t)(n) << CCFG_MODE_CONF_1_ALT_DCDC_IPEAK_SHIFT)
#define CCFG_MODE_CONF_1_ALT_DCDC_DITHER_EN     (1 << 19) /* Bit 19: Enable DC/DC dithering */
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_SHIFT    (20)      /* Bits 20-23: Minimum voltage for when DC/DC should be used */
                                                          /* Voltage = (28 + ALT_DCDC_VMIN) / 16 */
#define CCFG_MODE_CONF_1_ALT_DCDC_VMIN_MASK     (15 << CCFG_MODE_CONF_1_ALT_DCDC_VMIN_SHIFT)
#  define CCFG_MODE_CONF_1_ALT_DCDC_VMIN(n)     ((uint32_t)(n) << CCFG_MODE_CONF_1_ALT_DCDC_VMIN_SHIFT)

/* TIVA_CCFG_SIZE_AND_DIS_FLAGS */

#define CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR         (1 << 0)  /* Bit 0: Disable XOSC override */
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_ALT_DCDC_SETTING (1 << 1)  /* Bit 1: Disable alternate DC/DC settings */
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_GPRAM            (1 << 2)  /* Bit 2:  Disable GPRAM */
#define CCFG_SIZE_AND_DIS_FLAGS_DIS_TCXO             (1 << 3)  /* Bit 3: Disable TCXO */
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_SHIFT  (4)       /* Bits 4-15: Reserved for future use */
#define CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_MASK   (0xfff << CCFG_SIZE_AND_DIS_FLAGS_DISABLE_FLAGS_SHIFT)
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_SHIFT   (16)      /* Bits 16-31: otal size of CCFG in bytes */
#define CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_MASK    (0xffff << CCFG_SIZE_AND_DIS_FLAGS_SIZE_OF_CCFG_SHIFT)

/* TIVA_CCFG_MODE_CONF */

#define CCFG_MODE_CONF_VDDR_CAP_SHIFT                (0)       /* Bits 0-7: Minimum decoupling capacitance
                                                                * on VDDR (100nF units) */
#define CCFG_MODE_CONF_VDDR_CAP_MASK                 (0xff << CCFG_MODE_CONF_VDDR_CAP_SHIFT)
#  define CCFG_MODE_CONF_VDDR_CAP(n)                 ((uint32_t)(n) << CCFG_MODE_CONF_VDDR_CAP_SHIFT)
#define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_SHIFT     (8)       /* Bits 8-15: Trimmed XOSC cap-array step value modifier */
#define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_MASK      (0xff << CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_SHIFT)
#  define CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA(n)      ((uint32_t)(n) << CCFG_MODE_CONF_XOSC_CAPARRAY_DELTA_SHIFT)
#define CCFG_MODE_CONF_HF_COMP                       (1 << 16) /* Bit 16: Reserved for future use */
#define CCFG_MODE_CONF_XOSC_CAP_MOD                  (1 << 17) /* Bit 17: Enable modification to XOSC cap-array */
#define CCFG_MODE_CONF_XOSC_FREQ_SHIFT               (18)      /* Bits 18-19: Reserved for future use */
#define CCFG_MODE_CONF_XOSC_FREQ_MASK                (3 << CCFG_MODE_CONF_XOSC_FREQ_SHIFT)
#  define CCFG_MODE_CONF_XOSC_FREQ_HPOSC             (1 << CCFG_MODE_CONF_XOSC_FREQ_SHIFT)
#  define CCFG_MODE_CONF_XOSC_FREQ_48M               (2 << CCFG_MODE_CONF_XOSC_FREQ_SHIFT)
#  define CCFG_MODE_CONF_XOSC_FREQ_24M               (3 << CCFG_MODE_CONF_XOSC_FREQ_SHIFT)
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC            (1 << 21) /* Bit 21: VDDR trim sleep temp compensation */
#  define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC_NONE     (0)
#  define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC_ENABLE   CCFG_MODE_CONF_VDDR_TRIM_SLEEP_TC
#define CCFG_MODE_CONF_SCLK_LF_OPTION_SHIFT          (22)      /* Bits 22-23: Select source for SCLK_LF */
#define CCFG_MODE_CONF_SCLK_LF_OPTION_MASK           (3 << CCFG_MODE_CONF_SCLK_LF_OPTION_SHIFT)
#  define CCFG_MODE_CONF_SCLK_LF_OPTION_XOSC_HF_DLF  (0 << CCFG_MODE_CONF_SCLK_LF_OPTION_SHIFT
#  define CCFG_MODE_CONF_SCLK_LF_OPTION_EXTERNAL_LF  (1 << CCFG_MODE_CONF_SCLK_LF_OPTION_SHIFT
#  define CCFG_MODE_CONF_SCLK_LF_OPTION_XOSC_LF      (2 << CCFG_MODE_CONF_SCLK_LF_OPTION_SHIFT
#  define CCFG_MODE_CONF_SCLK_LF_OPTION_RCOSC_LF     (3 << CCFG_MODE_CONF_SCLK_LF_OPTION_SHIFT
#define CCFG_MODE_CONF_VDDS_BOD_LEVEL                (1 << 24) /* Bit nn: VDDS BOD level */
#  define CCFG_MODE_CONF_VDDS_BOD_2p0V               (0)
#  define CCFG_MODE_CONF_VDDS_BOD_1p8V               CCFG_MODE_CONF_VDDS_BOD_LEVEL
#define CCFG_MODE_CONF_VDDR_EXT_LOAD                 (1 << 25) /* Bit 25: Reserved for future use */
#define CCFG_MODE_CONF_DCDC_ACTIVE                   (1 << 26) /* Bit 26: DC/DC in active mode */
#define CCFG_MODE_CONF_DCDC_RECHARGE                 (1 << 27) /* Bit27nn: DC/DC during recharge in powerdown */
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_SHIFT   (28)      /* Bits 28-31: Signed delta value to apply to the
                                                                * VDDR_TRIM_SLEEP target, minus one */
#define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_MASK    (15 << CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_SHIFT)
#  define CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA(n)    (((uint8_t)((n) - 1) & 15) << CCFG_MODE_CONF_VDDR_TRIM_SLEEP_DELTA_SHIFT)

/* TIVA_CCFG_VOLT_LOAD_0 */

#define CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_SHIFT    (0)       /* Bits 0-7: Reserved for future use */
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_MASK     (0xff << CCFG_VOLT_LOAD_0_VDDR_EXT_TM15_SHIFT)
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_SHIFT     (8)       /* Bits 8-15: Reserved for future use */
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_MASK      (0xff << CCFG_VOLT_LOAD_0_VDDR_EXT_TP5_SHIFT)
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_SHIFT    (16)      /* Bits 16-23: Reserved for future use */
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_MASK     (0xff << CCFG_VOLT_LOAD_0_VDDR_EXT_TP25_SHIFT)
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_SHIFT    (24)      /* Bits 24-31: Reserved for future use */
#define CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_MASK     (0xff << CCFG_VOLT_LOAD_0_VDDR_EXT_TP45_SHIFT)

/* TIVA_CCFG_VOLT_LOAD_1 */

