apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_ccfg.h
/* TIVA_CCFG_CCFG_PROT_95_64 */

#define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC(n)     (1 << ((n) - 64))
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_64   (1 << 0)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_65   (1 << 1)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_66   (1 << 2)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_67   (1 << 3)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_68   (1 << 4)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_69   (1 << 5)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_70   (1 << 6)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_71   (1 << 7)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_72   (1 << 8)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_73   (1 << 9)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_74   (1 << 10)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_75   (1 << 11)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_76   (1 << 12)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_77   (1 << 13)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_78   (1 << 14)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_79   (1 << 15)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_80   (1 << 16)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_81   (1 << 17)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_82   (1 << 18)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_83   (1 << 19)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_84   (1 << 20)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_85   (1 << 21)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_86   (1 << 22)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_87   (1 << 23)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_88   (1 << 24)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_89   (1 << 25)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_80   (1 << 26)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_91   (1 << 27)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_92   (1 << 28)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_93   (1 << 29)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_94   (1 << 30)
#  define CCFG_CCFG_PROT_95_64_WRT_PROT_SEC_95   (1 << 31)

/* TIVA_CCFG_CCFG_PROT_127_96 */

#define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC(n)    (1 << ((n) - 96))
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_96  (1 << 0)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_97  (1 << 1)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_98  (1 << 2)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_99  (1 << 3)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_100 (1 << 4)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_101 (1 << 5)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_102 (1 << 6)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_103 (1 << 7)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_104 (1 << 8)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_105 (1 << 9)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_106 (1 << 10)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_107 (1 << 11)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_108 (1 << 12)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_109 (1 << 13)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_110 (1 << 14)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_111 (1 << 15)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_112 (1 << 16)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_113 (1 << 17)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_114 (1 << 18)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_115 (1 << 19)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_116 (1 << 20)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_117 (1 << 21)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_118 (1 << 22)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_119 (1 << 23)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_120 (1 << 24)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_121 (1 << 25)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_122 (1 << 26)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_123 (1 << 27)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_124 (1 << 28)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_125 (1 << 29)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_126 (1 << 30)
#  define CCFG_CCFG_PROT_127_96_WRT_PROT_SEC_127 (1 << 31)

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_CCFG_H */
